app/controllers/sessions_controller.rb

  def login
    user_params = params.require(:user).permit(:email, :password)
    @user = User.find_by(email: user_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "Bob@bob.com"]]