app/controllers/users_controller.rb

  def index
    @user = User.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "password", "first_name", "last_name", "phase", "display_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"